Revit 2024 API
IFCConnectedWallData Properties
The IFCConnectedWallData type exposes the following members.
Properties
Name | Description
ElementId
 The element id to which this element is joined.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Location
 The location for the join.
See Also
IFCConnectedWallData Class
Autodesk.Revit.DB.IFC Namespace